content/blog/episode_5.md
+++
title = "Episode 5: Blogging with Org mode and Emacs"
author = ["Rakhim Davletkaliyev"]
date = 2018-09-24T19:58:00+03:00
draft = false
creator = "Emacs 26.1 (Org mode 9.1.9 + ox-hugo)"
file_id = "2e1b070f-4475-47ba-9b2f-2bd27ac42c95"
youtube_id = "7s8cQ2cOnl8"
reddit_url = "https://www.reddit.com/r/emacs/comments/9ijtyp/emacscast_5_blogging_with_org_mode_and_oxhugo/"
+++

Switching from Helm to Ivy, Castlemacs and blogging with Org mode, ox-hugo and Hugo static site generator.


## Shownotes {#shownotes}


### Config news {#config-news}

-   [Updated config with Ivy instead of Helm](https://github.com/freetonik/emacs-dotfiles)
-   [Shackle](https://github.com/wasamasa/shackle) a way to control window creation
-   [Castlemacs](https://github.com/freetonik/castlemacs): modern, minimalist Emacs for macOS ⌘


### Exporting HTML with Org mode {#exporting-html-with-org-mode}

-   [Some HTML templates for Org exporter](https://github.com/fniessen/org-html-themes)
-   Another [very nice theme](https://gongzhitaao.org/orgcss/) (I'm going to set this as default for my setup)
-   [Wordpress](http://wordpress.org/)
-   [Aegea, the blogging engine](http://blogengine.me/)
-   My [blog in Russian that uses Jekyll](https://rakh.im/)


### Blogging with ox-hugo {#blogging-with-ox-hugo}

-   My [main blog in English](https://rakhim.org) powered by Hugo, ox-hugo and Org mode
-   [Hugo](https://gohugo.io/), another static website generator
-   [Ox-hugo](https://github.com/kaushalmodi/ox-hugo): a carefully crafted Org exporter back-end for Hugo
-   Section of ox-hugo documentation [on LaTeX](https://ox-hugo.scripter.co/doc/equations/)


#### Some articles on math produced with Mathjax {#some-articles-on-math-produced-with-mathjax}

-   [A Simple Introduction to Proof by Contradiction](https://rakhim.org/2018/09/a-simple-introduction-to-proof-by-contradiction/)
-   [A Simple Introduction to Proof by Induction](https://rakhim.org/2018/09/a-simple-introduction-to-proof-by-induction/)
